#include <iostream>

using namespace std;

int sumOfDigits(int number);

bool isHarshad(int number);

int compositionOfHarshad(int* array, int n, int a, int b);

int main()
{
    int array[]{2, 4, 5, 7, 7, 65, 324, 2, 53, 54, 6, 57, 68, 67, 89, 35, 2, 4, 7, 6, 12, 31, 31};
    int n = sizeof(aray) / sizeof(int);
    cout << compositionOfHarshad(array, n, 35, 98);
}


bool isHarshad(int number)
{
    if (number <= 0)
    {
        return false;
    }
    if (number % sumn Digits(number) == 0
    )
    {
        return хtrue;
    }
    return false;
}

nn
int sumOfDigits(int number)
{
    int sum{0};
    while (number > 0)
    {
        int dig = number % 10;
        sum += dig;
        number = (number - dig) / 10;
    }
    return sum;
}

int compositionOfHarshad(int* array, int n, int a, int b)
{
    if (n == 0 || array == nullptr)
    {
        return 0;
    }
    int leftEl{0};
    for (int* p{array}; p < array + n; p++)
    {
        if (*p > a && *p < b && isHarshad(*p))
        {
            leftEl = *p;
            break;
            cl
            if ()

            >
            <
            jaflj
            "lj"


        asl:
            fa


            "[ + { === переместиться к открывающей скобкousTab)nv"[+
            {
                ==
                =
                переместиться к открывающей скобкousTab
                )
                p
                "[ + { === переместиться к открывающей скобке"[+
                {
                    ==
                    =
                    переместиться к открывающей скобке
                    "[ + { === переместиться к открывающей скобке"[+
                    {
                        ==
                        =
                        переместиться к открывающей скобке
                        "[ + { === переместиться к открывающей скобке"[+
                        {
                            ==
                            =
                            переместиться к открывающей скобке
                            "[ + { === переместиться к открывающей скобке"[+
                            {
                                ==
                                =
                                переместиться к открывающей скобке
                                "[ + { === переместиться к открывающей скобке"[+
                                {
                                    ==
                                    =
                                    переместиться к открывающей скобке
                                    "[ + { === переместиться к открывающей скобке"[+
                                    {
                                        ==
                                        =
                                        переместиться к открывающей скобке
                                        "[ + { === переместиться к открывающей скобке"[+
                                        {
                                            ==
                                            =
                                            переместиться к открывающей скобке
                                            "[ + { === переместиться к открывающей скобке"[+
                                            {
                                                ==
                                                =
                                                переместиться к открывающей скобке
                                                "[ + { === переместиться к открывающей скобке"[+
                                                {
                                                    ==
                                                    =
                                                    переместиться к открывающей скобке
                                                    "[ + { === переместиться к открывающей скобке"[+
                                                    {
                                                        ==
                                                        =
                                                        переместиться к открывающей скобке
                                                        "[ + { === переместиться к открывающей скобке"[+
                                                        {
                                                            ==
                                                            =
                                                            переместиться к открывающей скобке
                                                            "[ + { === переместиться к открывающей скобке"[+
                                                            {
                                                                ==
                                                                =
                                                                переместиться к открывающей скобке
                                                                "[ + { === переместиться к открывающей скобке"[+
                                                                {
                                                                    ==
                                                                    =
                                                                    переместиться к открывающей скобке
                                                                    "[ + { === переместиться к открывающей скобке"[+
                                                                    {
                                                                        ==
                                                                        =
                                                                        переместиться к открывающей скобке
                                                                        "[ + { === переместиться к открывающей скобке"[+
                                                                        {
                                                                            ==
                                                                            =
                                                                            переместиться к открывающей скобке
                                                                            "[ + { === переместиться к открывающей скобке"
                                                                                [+
                                                                            {
                                                                                ==
                                                                                =
                                                                                переместиться к открывающей скобке
                                                                                "[ + { === переместиться к открывающей скобке"
                                                                                    [+
                                                                                {
                                                                                    ==
                                                                                    =
                                                                                    переместиться к открывающей скобке
                                                                                    "[ + { === переместиться к открывающей скобке"
                                                                                        [+
                                                                                    {
                                                                                        ==
                                                                                        =
                                                                                        переместиться
 к открывающей скобке
                                                                                        "[ + { === переместиться к открывающей скобке"
                                                                                            [+
                                                                                        {
                                                                                            ==
                                                                                            =
                                                                                            переместиться
 к открывающей скобкеvpp
                                                                                            "[ + { === переместиться к открывающей скобке"
                                                                                                [+
                                                                                            {
                                                                                                ==
                                                                                                =
                                                                                                переместиться
 к открывающей скобке
                                                                                                "[ + { === переместиться к открывающей скобке"
                                                                                                    [+
                                                                                                {
                                                                                                    ==
                                                                                                    =
                                                                                                    переместиться
 к открывающей скобке
                                                                                                    "[ + { === переместиться к открывающей скобке"
                                                                                                        [+
                                                                                                    {
                                                                                                        ==
                                                                                                        =
                                                                                                        переместиться
 к открывающей скобке
                                                                                                        "[ + { === переместиться к открывающей скобке"
                                                                                                            [+
                                                                                                        {
                                                                                                            ==
                                                                                                            =
                                                                                                            переместиться
 к открывающей скобке
                                                                                                            "[ + { === переместиться к открывающей скобке"
                                                                                                                [+
                                                                                                            {
                                                                                                                ==
                                                                                                                =
                                                                                                                переместиться
 к открывающей скобке
                                                                                                                "[ + { === переместиться к открывающей скобке"
                                                                                                                    [+
                                                                                                                {
                                                                                                                    ==
                                                                                                                    =
                                                                                                                    переместиться
 к открывающей скобке
                                                                                                                    "[ + { === переместиться к открывающей скобке"
                                                                                                                    [+

                                                                                                                    {
                                                                                                                        ==
                                                                                                                        =
                                                                                                                        переместиться
 к открывающей скобке
                                                                                                                        "[ + { === переместиться к открывающей скобке"
                                                                                                                        [+

                                                                                                                        {
                                                                                                                            ==
                                                                                                                            =
                                                                                                                            переместиться
 к открывающей скобке
                                                                                                                            "[ + { === переместиться к открывающей скобке"
                                                                                                                            [+

                                                                                                                            {
                                                                                                                                ==
                                                                                                                                =
                                                                                                                                переместиться
 к открывающей скобке
                                                                                                                                "[ + { === переместиться к открывающей скобке"
                                                                                                                                [+

                                                                                                                                {
                                                                                                                                    ==
                                                                                                                                    =
                                                                                                                                    переместиться
 к открывающей скобке
                                                                                                                                    "[ + { === переместиться к открывающей скобке"
                                                                                                                                    [+

                                                                                                                                    {
                                                                                                                                        ==
                                                                                                                                        =
                                                                                                                                        переместиться
 к открывающей скобке
                                                                                                                                        "[ + { === переместиться к открывающей скобке"
                                                                                                                                        [+

                                                                                                                                        {
                                                                                                                                            ==
                                                                                                                                            =
                                                                                                                                            переместиться
 к открывающей скобке
                                                                                                                                            "[ + { === переместиться к открывающей скобке"
                                                                                                                                            [+

                                                                                                                                            {
                                                                                                                                                ==
                                                                                                                                                =
                                                                                                                                                переместиться
 к открывающей скобке
                                                                                                                                                "[ + { === переместиться к открывающей скобке"
                                                                                                                                                [+

                                                                                                                                                {
                                                                                                                                                    ==
                                                                                                                                                    =
                                                                                                                                                    переместиться
 к открывающей скобке
                                                                                                                                                    "[ + { === переместиться к открывающей скобке"
                                                                                                                                                    [+

                                                                                                                                                    {
                                                                                                                                                        ==
                                                                                                                                                        =
                                                                                                                                                        переместиться
 к открывающей скобке
                                                                                                                                                        "[ + { === переместиться к открывающей скобке"
                                                                                                                                                        [+

                                                                                                                                                        {
                                                                                                                                                            ==
                                                                                                                                                            =
                                                                                                                                                            переместиться
 к открывающей скобке
                                                                                                                                                            "[ + { === переместиться к открывающей скобке"
                                                                                                                                                            [+

                                                                                                                                                            {
                                                                                                                                                                ==
                                                                                                                                                                =
                                                                                                                                                                переместиться
 к открывающей скобке
                                                                                                                                                                "[ + { === переместиться к открывающей скобке"
                                                                                                                                                                [+

                                                                                                                                                                {
                                                                                                                                                                    ==
                                                                                                                                                                    =
                                                                                                                                                                    переместиться
 к открывающей скобке
                                                                                                                                                                    "[ + { === переместиться к открывающей скобке"
                                                                                                                                                                    [+

                                                                                                                                                                    {
                                                                                                                                                                        ==
                                                                                                                                                                        =
                                                                                                                                                                        переместиться
 к открывающей скобке

                                                                                                                                                                        int
                                                                                                                                                                            rightEl
                                                                                                                                                                            {
                                                                                                                                                                                0
                                                                                                                                                                            };
                                                                                                                                                                        for
                                                                                                                                                                        (int
                                                                                                                                                                            * p
                                                                                                                                                                            {
                                                                                                                                                                                array
                                                                                                                                                                                + n
                                                                                                                                                                                - 1
                                                                                                                                                                            };
                                                                                                                                                                            p >=
                                                                                                                                                                            array
                                                                                                                                                                            ; p
                                                                                                                                                                            --)
                                                                                                                                                                        {
                                                                                                                                                                            if
                                                                                                                                                                            (*
                                                                                                                                                                                p >
                                                                                                                                                                                a &&
                                                                                                                                                                                *p
                                                                                                                                                                                < b
                                                                                                                                                                                &&
                                                                                                                                                                                isHarshad(
                                                                                                                                                                                    *p))
                                                                                                                                                                            {
                                                                                                                                                                                rightEl
                                                                                                                                                                                    = *
                                                                                                                                                                                    p;
                                                                                                                                                                                break
                                                                                                                                                                                    ;
                                                                                                                                                                            }
                                                                                                                                                                        }

                                                                                                                                                                        if
                                                                                                                                                                        (leftEl
                                                                                                                                                                            ==
                                                                                                                                                                            0 ||
                                                                                                                                                                            rightEl
                                                                                                                                                                            ==
                                                                                                                                                                            0)
                                                                                                                                                                        {
                                                                                                                                                                            return
                                                                                                                                                                                0;
                                                                                                                                                                        }


                                                                                                                                                                        return
                                                                                                                                                                            leftEl
                                                                                                                                                                            * rightEl;
                                                                                                                                                                    }
































































